/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_lst_printf.c                                    :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: spowers <marvin@42.fr>                     +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/08/05 21:40:39 by spowers           #+#    #+#             */
/*   Updated: 2020/08/05 21:40:44 by spowers          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_printf.h"
// инициализация структуры значениями 
// структура хранит информацию о спецификаторе формата (между % и буквой)
// выделяет память под экземпляр t_list структуры 
// инициализирует поля структуры где будет выделена память 
// возвращает адрес куска памяти где лежит t_list
t_list	*ft_list(void)
{
	t_list *list;

	if (!(list = malloc(sizeof(t_list))))
		return (NULL);
	list->index = -1;
	list->width = 0;
	list->withprecision = 0;
	list->precision = 0;
	return (list);
}
